Tekla Open API Reference for Tekla Structures 2025
ClashCheckHandler.StopClashCheck Method
 Stops the clash checking.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool StopClashCheck()
Public Function StopClashCheck As Boolean
Return Value
Type: Boolean
True on success.
Remarks
Stops the clash check only when the Advanced Options' XS_USE_NEW_CLASH_CHECK is set.
See Also
Reference
ClashCheckHandler Class
Tekla.Structures.Model Namespace